#include "set.h"

/*
Спроектувати клас «Множина цілих чисел» (АТД), який є спадкоємцем абстрактного класу
«Структура даних». Визначити для базового класу абстрактну функцію Операція,
перевизначивши її в дочірньому класі для визначення перетину двох множин. Класи повинні 
також мати конструктори, у тому числі порожній, метод виведення об’єктів даного класу,

Розробити програму, яка створює два об’єкта-множини, кожна з яких є символами, введеного
з клавіатури, слова, і визначає їх перетин.

Записати кожну вхідну множину і отриманий їх перетин у окремі рядки текстового файлу,
відділивши елементи множин двокрапкою. Вивести (програмно) вміст створеного файлу для перегляду
*/

int main() {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	string line1, line2;
	cout << "Введіть рядок 1: ";
	getline(cin, line1);
	cout << "Введіть рядок 2: ";
	getline(cin, line2);

	Set set1, set2;

	for (char c : line1) {
		set1.add(c);
	}
	for (char c : line2) {
		set2.add(c);
	}

	cout << "Множина 1: ";
	set1.show();
	cout << "Множина 2: ";
	set2.show();

	Set result = set1.operation(set2);

	cout << endl << "Вміст файлу: " << endl;

	File file;
	file.write(set1, set2, result);
	file.show();

	return 0;
}